[
    {
        "id": "1",
        "name": "AI Bible Study Helper",
        "image": "/profile.jpg",
        "short": "Another significant project I paricipated is in developing an AI-powered Bible study assistant",
        "description": "Another significant project I paricipated is in developing an AI-powered Bible study assistant, built using Retrieval-Augmented Generation (RAG). This tool is designed to help users explore biblical texts more deeply by providing context-aware responses, historical insights, and relevant scripture connections. By leveraging advanced AI techniques, the assistant can pull relevant verses, theological interpretations, and cross-references to enhance study sessions. Whether users are looking for deeper theological understanding, contextual explanations, or connections between passages, this AI-powered assistant acts as a guide, making Bible study more interactive and insightful. The implementation of RAG ensures accurate and meaningful responses, creating a more engaging and educational experience for users.",
        "status": "active",
        "github": "https://github.com/VerseWise/verse-wise-cms.git"
    },
    {
        "id": "2",
        "name": "Todo List App",
        "image": "/profile.jpg",
        "short": "One of my projects is a well-structured and highly functional Todo List app, designed to streamline task management",
        "description": "One of my projects is a well-structured and highly functional Todo List app, designed to streamline task management for users. The app features an intuitive user interface that allows for seamless task creation, editing, and organization. With a focus on user experience, it includes features like due date reminders, priority levels, and categorization to help users stay productive. I implemented efficient state management to ensure smooth interactions, and the app adapts well across different devices. By integrating modern frameworks and best coding practices, this Todo List app provides a simple yet powerful way to manage daily tasks efficiently.",
        "status": "active",
        "github": "https://github.com/AbrehamElka/simple-todo-next.git"
    }
]